DK/Development/Hotfix 1.3.2/BizTalk/INTSTDK003.CrmRealTime/Files/CreateCustCase.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:cgix="http://schemas.datacontract.org/2004/07/CGIXrmCreateCaseService">
  <soapenv:Header/>
  <soapenv:Body>
    <tem:RequestCreateCase>
      <!--Optional:-->
      <tem:request>
        <!--Optional:-->
        <cgix:CardNumber>?</cgix:CardNumber>
        <!--Optional:-->
        <cgix:City>Stockholm</cgix:City>
        <!--Optional:-->
        <cgix:ContactCustomer>true</cgix:ContactCustomer>
        <!--Optional:-->
        <cgix:ControlFeeNumber>14</cgix:ControlFeeNumber>
        <!--Optional:-->
        <cgix:County>Sweden</cgix:County>
        <!--Optional:-->
        <cgix:Customer>416758F3-5345-E411-80D1-0050569010AD</cgix:Customer>
        <!--Optional:-->
        <cgix:CustomerType>Private</cgix:CustomerType>
        <!--Optional:-->
        <cgix:CustomersCategory>true</cgix:CustomersCategory>
        <!--Optional:-->
        <cgix:CustomersSubcategory>true</cgix:CustomersSubcategory>
        <!--Optional:-->
        <cgix:Description>true</cgix:Description>
        <!--Optional:-->
        <cgix:DocumentList>
          <!--Zero or more repetitions:-->
          <cgix:document>
            <!--Optional:-->
            <cgix:DocumentBody>cid:117374923427</cgix:DocumentBody>
            <!--Optional:-->
            <cgix:FileName>?</cgix:FileName>
            <!--Optional:-->
            <cgix:NoteText>?</cgix:NoteText>
            <!--Optional:-->
            <cgix:Subject>?</cgix:Subject>
          </cgix:document>
        </cgix:DocumentList>
        <!--Optional:-->
        <cgix:EmailAddress>true</cgix:EmailAddress>
        <!--Optional:-->
        <cgix:FirstName>true</cgix:FirstName>
        <!--Optional:-->
        <cgix:InvoiceNumber/>
        <!--Optional:-->
        <cgix:LastName>true</cgix:LastName>
        <!--Optional:-->
        <cgix:Line/>
        <!--Optional:-->
        <cgix:Title>true</cgix:Title>
        <!--Optional:-->
        <cgix:Train>true</cgix:Train>
        <!--Optional:-->
        <cgix:WayOfTravel>true</cgix:WayOfTravel>
      </tem:request>
    </tem:RequestCreateCase>
  </soapenv:Body>
</soapenv:Envelope>